# Homebrew packages for macOS
#
# CLI tools are managed by Nix (Home Manager) — see nix/README.md.
# Homebrew is retained only for GUI applications (cask) and fonts that are
# either macOS-only or significantly easier to install via cask.

# Cask applications
cask "alacritty"
cask "1password"
cask "1password-cli"
cask "atok"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cursor"
cask "deepl"
cask "dropbox"
cask "figma"
cask "google-chrome"
cask "google-drive"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-office-businesspro"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "orbstack"
cask "path-finder"
cask "postman"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "zoom"

# Fonts
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-udev-gothic"
cask "font-udev-gothic-hs"
cask "font-udev-gothic-nf"
