tap "eth-p/software"
tap "homebrew/bundle"
brew "act"
brew "bat"
brew "libxml2"
brew "gettext"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "curlie"
brew "deno"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "jq"
brew "neovim"
brew "openjdk@11"
brew "openjdk@8"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "starship"
brew "swagger-codegen"
brew "tig"
brew "tmux"
brew "z"
brew "bat-extras"
